#+TITLE: emacs lisp 学習
#+OPTIONS: num:nil

* point とは

#+begin_src elisp
  (point)
#+end_src

#+RESULTS:
: 2532

同じバッファーでもウィンドウが異なれば point の返す値は異なる場合があ
ります。

#+begin_src elisp
  (point-min) ;; e.g => 1
  (point-max) ;; e.g => 8967
#+end_src

* バッファリスト

#+begin_src elisp :results list
  (buffer-list)
#+end_src

#+RESULTS:
- #<buffer elisp-examples.org>
- #<buffer  *Minibuf-1*>
- #<buffer lisp>
- #<buffer kf-command.org>
- #<buffer  *Minibuf-2*>
- #<buffer .emacs.d>
- #<buffer *scratch*>
- #<buffer  *Minibuf-0*>
- #<buffer *Messages*>
- #<buffer  *Echo Area 0*>
- #<buffer  *Echo Area 1*>
- #<buffer  *code-conversion-work*>
- #<buffer *straight-process*>
- #<buffer *Async-native-compile-log*>
- #<buffer  *string-pixel-width*>
- #<buffer *quelpa-build-checkout*>
- #<buffer  *IBus(:0.0)*>
- #<buffer *Warnings*>
- #<buffer  *org-src-fontification:emacs-lisp-mode*>
- #<buffer  *which-key*>
- #<buffer  *Org parse*>
- #<buffer  *org-src-fontification:sh-mode*>


この中から操作対象を抽出する。
一般形式は
#+begin_src
  (seq-filter PRED LIST)
#+end_src

** ファイルに結びついたファイル
#+begin_src elisp :results list
  (seq-filter #'buffer-file-name (buffer-list))
#+end_src

#+RESULTS:
- #<buffer elisp-examples.org>
- #<buffer kf-command.org>

** 加工されたバッファ
  #+begin_src elisp :results list
  (seq-filter #'buffer-modified-p (buffer-list))
  #+end_src

#+RESULTS:
- #<buffer elisp-examples.org>
- #<buffer  *Minibuf-1*>
- #<buffer kf-command.org>
- #<buffer  *Minibuf-2*>
- #<buffer *scratch*>
- #<buffer *Messages*>
- #<buffer  *Echo Area 0*>
- #<buffer  *Echo Area 1*>
- #<buffer  *code-conversion-work*>
- #<buffer *straight-process*>
- #<buffer *Async-native-compile-log*>
- #<buffer  *string-pixel-width*>
- #<buffer *quelpa-build-checkout*>
- #<buffer *Warnings*>
- #<buffer  *which-key*>
  

